
    !/////////////////////////////////////////////////////////////////////SUB_INTERPOLATION

!子程序功能：通过已给的坐标进行线性插值，可实现内外插功能，且不对原有数组进行大小排序。

SUBROUTINE INTERPOLATION(	N,	&	!已知坐标的数量  (个)			//输入参数
								X,	&	!存有N个横坐标的数组X			//输入参数
								Y,	&	!存有N个纵坐标的数组Y			//输入参数
								FX,	& 	!所要插入点的横坐标的值			//输入参数
								FY)		!插值的纵坐标					//输出参数


	IMPLICIT NONE

!	/////////////////////////////////参数说明////////////////////////////////////// 

	INTEGER :: N		!已知坐标的数量  (个)			//输入参数
	REAL*8 :: X(N)		!存有N个横坐标的数组X			//输入参数
	REAL*8 :: Y(N)		!存有N个纵坐标的数组Y			//输入参数
	REAL*8 :: FX	 	!所要插入点的横坐标的值			//输入参数
	REAL*8 :: FY		!插值的纵坐标					//输出参数
    INTEGER :: I		!计数器           (  /  )       //中间变量

!	/////////////////////////////////参数说明//////////////////////////////////////

!	/////////////////////////////////计算部分//////////////////////////////////////		 
	! 内插
	IF(FX.GE.X(1) .AND. FX.LE.X(N) .OR. FX.LE.X(1) .AND. FX.GE.X(N))THEN

		DO I = 1, N

			IF(I < N)  THEN

				IF(FX.GE.X(I) .AND. FX.LE.X(I+1) .OR. FX.LE.X(I) .AND. FX.GE.X(I+1))  THEN

						FY = Y(I) * (X(I+1) - FX) / (X(I+1) - X(I))	+Y(I+1) * (FX - X(I)) / (X(I+1) - X(I)) 
									

				END IF

			END IF

		END DO
	
	!外插
	ELSE IF(X(1).LT.X(N) .AND. FX.LT.X(1) .OR. X(1).GT.X(N).AND. FX.GT.X(1))THEN

			FY = Y(1) * (X(2) - FX) / (X(2) - X(1)) + Y(2) * (FX - X(1)) / (X(2) - X(1))
													
	ELSE

			FY = Y(N-1) * (X(N) - FX) / (X(N) - X(N-1)) + Y(N) * (FX - X(N-1)) / (X(N) - X(N-1))
										
	END IF
!	/////////////////////////////////计算部分//////////////////////////////////////	

END SUBROUTINE INTERPOLATION
